---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.Camera.EyePosition
source: html/9c936ff2-5f8f-67c9-d6d6-a812bd281289.htm
---
# Autodesk.Revit.DB.DirectContext3D.Camera.EyePosition Property

Camera's position in the world

## Syntax (C#)
```csharp
public XYZ EyePosition { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null